URLShortener/app/models/shortened_url.rb

  def self.random_code
    temp = SecureRandom.urlsafe_base64
    while ShortenedUrl.exists?(:short_url => temp)
---
SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "M_uLDdnRLqyt_ZVdEA-dfA"], ["LIMIT", 1]]

  def self.create_short_url(user, long_url_input)
    short_url = ShortenedUrl.random_code
    ShortenedUrl.create!(long_url: long_url_input, short_url: short_url, user_id: user.id)
---
INSERT INTO "shortened_urls" ("short_url", "long_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"